Revit 2026 API

# ProjectLocationSetProjectPosition Method

---

Sets the coordinates of a point in the ProjectLocation's coordinate system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetProjectPosition(
	XYZ point,
	ProjectPosition position
)
```
```vb
Public Sub SetProjectPosition (
	point As XYZ,
	position As ProjectPosition
)
```
```cpp
public:
void SetProjectPosition(
	XYZ^ point,
	ProjectPosition^ position
)
```
```fsharp
member SetProjectPosition :
        point : XYZ *
        position : ProjectPosition -> unit
```

#### Parameters

point XYZ

position ProjectPosition

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Unable to use the project position's transform to calculate the point. |

When setting this value, the transformations applied to the location are modified such that the passed point becomes the specified North/South, East/West and Elevation, and the coordinate transform will have the designated angular rotation. This is similar to the Revit command "Specify Coordinates at Point".

#### Reference

ProjectLocation Class

Autodesk.Revit.DB Namespace